src/InformationRegisters/кфк_т_ТестовыйРегистрСведенийПР/кфк_т_ТестовыйРегистрСведенийПР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>кфк_т_ТестовыйРегистрСведенийПР</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/кфк_т_ТестовыйРегистрСведенийПР/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура СгенерироватьТестовыеДанные(Количество, РазмерСправочника) Экспорт
	
	ГСЗ = Обработки.кфк_т_ГенераторСлучайныхЗначений.Создать();
	
	ТекстЗапрос = "ВЫБРАТЬ ПЕРВЫЕ &Количество1 З.Ссылка 
	|	ИЗ (ВЫБРАТЬ ПЕРВЫЕ &Количество2 Документ.кфк_т_ТестовыйДокумент.Ссылка УПОРЯДОЧИТЬ ПО Ссылка УБЫВ) КАК З
	|	УПОРЯДОЧИТЬ ПО Ссылка";
	ТекстЗапрос = СтрЗаменить(ТекстЗапрос, "&Количество1", XMLСтрока(Количество));
	ТекстЗапрос = СтрЗаменить(ТекстЗапрос, "&Количество2", XMLСтрока(ГСЗ.СлучайноеЧисло(Количество, РазмерСправочника)));
	Запрос = Новый Запрос(ТекстЗапрос);
	//@skip-check undefined-variable
	ТестовыйСправочник = кфкОбщегоНазначенияСлужебный.ВыбратьКолонку(Запрос.Выполнить().Выбрать(), "Ссылка");
	Если ТестовыйСправочник.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Не заполнен ''Тестовый документ''!'");
	КонецЕсли;
	
	Регистратор = ГСЗ.СлучайноеЗначениеИзСписка(ТестовыйСправочник);
	
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.Регистратор.Установить(Регистратор);
	
	Для Номер = 1 По Количество Цикл
		
		НоваяСтрока = Набор.Добавить();
		НоваяСтрока.Период = ТекущаяДатаСеанса();
		НоваяСтрока.Регистратор = Регистратор;
		НоваяСтрока.Идентификатор = Новый УникальныйИдентификатор;
		НоваяСтрока.Значение = ГСЗ.СлучайноеЧисло(, , 2);
		
	КонецЦикла;
	
	Набор.ОбменДанными.Загрузка = Истина;
	Набор.ДополнительныеСвойства.Вставить("кфкПропуститьРегистрацию", Истина);
	Набор.Записать();
	
КонецПроцедуры

// Экспортируемая серверная функция, формирующая тело сообщения для отправки в Kafka.
// 
//  !!! ВНИМАНИЕ !!!
//  Если при регистрации регистра набор записей пуст, то:
//   * флаг ЭтоУдаление будет установлен в значение ДА;
//   * параметр Объект будет содержать значения полей, указанных в отборе.
// 
// Параметры:
//   Объект - СправочникОбъект, ДокументОбъект - Объект ссылочного типа. Передаётся, если регистрация по записи объекта или объект был передан в кфкИнтеграция.ПоместитьВОчередьИсходящих.
//     - ЛюбаяСсылка - Ссылка на объект, переданная в кфкИнтеграция.ПоместитьВОчередьИсходящих
//     - Структура, Соответствие Из Произвольный - произвольное сообщение.
//     - Структура - запись регистра сведений, где ключи соответствуют полям регистра, включая 'ДополнительныеСвойства' набора записей.
//     - Структура - строка табличной части, где ключи соответствуют колонкам табличной части.
//     - Структура - описание движений регистра:
//       * Регистратор - ДокументСсылка - Регистратор движений;
//       * ДополнительныеСвойства - Структура - Дополнительные свойства набора записей регистра.
//   Свойства - Структура - Дополнительные свойства сообщения:
//     * Продюсер - СправочникСсылка.кфкПродюсеры - Продюсер сообщения;
//     * ТипОбъект - Строка - Тип объекта, к которому относится сообщение;
//     * ТипИсходныхДанных - Строка - Тип исходных данных, к которому относится сообщение;
//     * СобытиеРегистрации - ПеречислениеСсылка.кфкСобытияРегистрации - Событие регистрации к обмену, см. кфкИнтеграция.ЭтоРегистрацияПриЗаписи, ЭтоРегистрацияПринудительно, ЭтоРегистрацияПрограммно;
//     * КлючРегистрации - Строка - Уникальный ключ регистрации;
//     * ДатаРегистрации - Дата - Дата регистрации события;
//     * ДатаРегистрацииМС - Число - Дата регистрации в миллисекундах;
//     * ПоследняяОбработка - Дата - Дата последней обработки сообщения;
//     * ЭтоУдаление - Булево - Флаг, указывающий, что регистрация была вызвана событием удаления;
//     * СсылкаНаОбъект - Неопределено, ЛюбаяСсылка - Ссылка на объект, к которому относится регистрация.
//   ТекстЖурнала - Строка - Текст журнала
//   Отказ - Булево - Признак отмены формирования и отправки сообщения.
// 
// Возвращаемое значение:
//   Неопределено, Структура - Описание сообщения, кфкИнтеграция.ПараметрыСообщения():
//     * Данные - Строка, ДвоичныеДанные, Структура - Тело сообщения
//     * Ключ - Строка - Уникальный идентификатор сообщения
//     * Заголовки - Соответствие Из Строка - Заголовки сообщения
//@skip-check doc-comment-type
//@skip-check doc-comment-ref-link
Функция Сериализация(Объект, Свойства, ТекстЖурнала, Отказ) Экспорт
	
	Данные = Новый Массив; // Массив Из Структура
	
	Результат = МодульКФК().ПараметрыСообщения();
	Результат.Данные = Данные;
	Результат.Заголовки.Вставить("ДатаСериализация", ТекущаяУниверсальнаяДата());
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	Т.Период КАК period,
		|	Т.Регистратор КАК recorder,
		|	Т.Идентификатор КАК id,
		|	Т.Значение КАК value
		|ИЗ
		|	РегистрСведений.кфк_т_ТестовыйРегистрСведенийПР КАК Т
		|ГДЕ
		|	Т.Регистратор = &Регистратор";
	Запрос.УстановитьПараметр("Регистратор", Объект.Регистратор);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Поля = СтрСоединить(ОбщегоНазначения.ВыгрузитьКолонку(Выборка.Владелец().Колонки, "Имя"), ",");
	Пока Выборка.Следующий() Цикл
		
		Запись = Новый Структура(Поля);
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Данные.Добавить(Запись);
		
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция МодульКФК()
	
	//@skip-check bsl-legacy-check-string-literal
	Возврат ОбщегоНазначения.ОбщийМодуль("кфкИнтеграция");
	
КонецФункции

#КонецОбласти

#КонецЕсли
